/*
Арифметическое выражение. Даны n чисел a[1], a[2], ..., a[n]. Расставьте между ними плюсы ‘+’ и минусы ‘-’, чтобы значение полученного выражения было равно xx.

Входные данные:
В первой строке заданы два целых числа - n и x. Во второй строке содержатся целые положительные числа a[1], a[2], ..., a[n].

Выходные данные:
Выведите арифметическое выражение, значение которого равно x. Числа в выражении должны идти в том же порядке, что и во входном файле. Необходимо использовать все числа. Между каждой парой чисел  должен быть знак ‘+’ или ‘-’. Минус перед первым числом ставить нельзя.

Пример входных данных:
3 0
1 2 3

Пример выходных данных:
1+2-3
*/
